{
  "program_name": "English Composition – Group A",
  "program_description": "Courses below are open to students in English Placement Group A. Placement is required to determine class placement. See smc.edu/successcenter. Some of the courses listed in this section are accompanied by Supplemental Instruction. Supplemental Instruction (SI) is an academic assistance program that utilizes free peer-assisted weekly study sessions to help students learn the most difficult course content. For more information, please see the SI website at smc.edu/si. ENGL C1000, ACADEMIC READING AND WRITING 3 UNITS Transfer: UC, CSU Cal-GETC Area 1A (English Composition) • Prerequisite: Placement as determined by the college’s multiple measures assessment process. Formerly ENGL 1. In this course, students receive instruction in academic reading and writing, including writing processes, effective use of language, analytical thinking, and the foundations of academic research. 1959 8:00a.m.-9:20a.m. MW DRSCHR 203 Driscoll L V Above section modality is On Ground. 1960 8:00a.m.-9:20a.m. MW ONLINE Stirling M S Above section modality is Scheduled. 1961 8:00a.m.-9:20a.m. MW DRSCHR 202 Kauffman S R Above section modality is On Ground. 1962 8:00a.m.-9:20a.m. MW ONLINE Martinez-Gil C Above section modality is Scheduled. 1966 8:00a.m.-9:20a.m. MW DRSCHR 201 Desai D H Above section modality is On Ground. 1967 8:00a.m.-9:20a.m. MW HSS 151 Grodsky R Above section modality is On Ground. 1968 8:00a.m.-9:20a.m. M DRSCHR 215 Hall J E Arrange-1.5 Hours ONLINE Hall J E Above section 1968 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. 1970 8:00a.m.-9:20a.m. TTh DRSCHR 215 Olvey K Above section modality is On Ground. 1971 8:00a.m.-9:20a.m. TTh DRSCHR 208 Ross M S Above section modality is On Ground. 1972 8:00a.m.-9:20a.m. TTh DRSCHR 202 Sterling A K Above section modality is On Ground. 1973 8:00a.m.-9:20a.m. TTh ONLINE Hassman T Above section modality is Scheduled. 1974 8:00a.m.-9:20a.m. TTh DRSCHR 221 Jones S T Above section modality is On Ground. 1977 8:00a.m.-9:20a.m. TTh DRSCHR 218 Martin Ki Above section modality is On Ground. 1981 9:00a.m.-12:05p.m. S HSS 156 Traynham K Above section modality is On Ground. 1982 9:30a.m.-10:50a.m. MW DRSCHR 211 Padilla M R Above section 1982 is part of the Adelante program though enrollment is open to all students. See the Special Programs section of the class schedule or smc.edu/latinocenter for more information. Above section modality is On Ground. 1983 9:30a.m.-10:50a.m. MW DRSCHR 203 Driscoll L V Above section 1983 is part of the Scholars Program and enrollment is temporarily limited to program participants. See the Special Programs section of the class schedule or smc.edu/scholars for more information. Above section modality is On Ground. 1984 9:30a.m.-10:50a.m. MW ONLINE Stirling M S Above section modality is Scheduled. 1986 9:30a.m.-10:50a.m. MW DRSCHR 202 Kauffman S R Above section modality is On Ground. 1987 9:30a.m.-10:50a.m. MW ONLINE Sterling A K Above section modality is Scheduled. 1988 9:30a.m.-10:50a.m. MW DRSCHR 201 Paik J Above section modality is On Ground. 1990 9:30a.m.-10:50a.m. MW MALBU 119 Garcia M S Above section 1990 meets at the Malibu Campus, 23555 Civic Center Way, Malibu. Please be advised that the distance between the SMC Main Campus and the Malibu Campus is approximately 15 miles. Please plan your schedule to accommodate travel time, which will vary depending on time of day and mode of transportation. Above section modality is On Ground. 1992 9:30a.m.-10:50a.m. M DRSCHR 221 Hall J E Arrange-1.5 Hours ONLINE Hall J E Above section 1992 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. 1993 9:30a.m.-10:50a.m. M PV 171 Meyer E E Arrange-1.5 Hours ONLINE Meyer E E Above section 1993 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. 1994 9:30a.m.-10:50a.m. M HSS 253 Ireland S P Arrange-1.5 Hours ONLINE Ireland S P Above section 1994 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. 1995 9:30a.m.-10:50a.m. TTh ONLINE Hassman T Above section modality is Scheduled. 1996 9:30a.m.-10:50a.m. TTh ONLINE Martinez-Gil C Above section modality is Scheduled. 1997 9:30a.m.-10:50a.m. TTh ONLINE Hertz U L Above section modality is Scheduled. 1998 9:30a.m.-10:50a.m. TTh DRSCHR 202 Sterling A K Above section modality is On Ground. 1999 9:30a.m.-10:50a.m. TTh CMD 102 Karron R Above section 1999 meets at the Center for Media and Design, 1660 Stewart Street, Santa Monica CA 90404. Above section modality is On Ground. 2000 9:30a.m.-10:50a.m. TTh DRSCHR 221 Hamada M J Above section modality is On Ground. 2001 9:30a.m.-10:50a.m. TTh DRSCHR 215 Olvey K Above section 2001 is part of the Scholars Program and enrollment is temporarily limited to program participants. See the Special Programs section of the class schedule or smc.edu/scholars for more information. Above section modality is On Ground. 2002 9:30a.m.-10:50a.m. TTh PA 03 Young W H Above section modality is On Ground. 2004 9:30a.m.-10:50a.m. T DRSCHR 203 Misaghi A M Arrange-1.5 Hours ONLINE Misaghi A M Above section 2004 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. 2005 9:30a.m.-10:50a.m. T BUS 251 Onugha E L Arrange-1.5 Hours ONLINE Onugha E L Above section 2005 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. 2007 9:30a.m.-10:50a.m. W HSS 252 Hall J E Arrange-1.5 Hours ONLINE Hall J E Above section 2007 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. 2009 9:30a.m.-10:50a.m. Th PV 172 Miller N A Arrange-1.5 Hours ONLINE Miller N A Above section 2009 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. 2010 9:30a.m.-12:35p.m. F DRSCHR 202 Karron R Above section modality is On Ground. 2011 11:15a.m.-12:35p.m. MW DRSCHR 218 Paik J Above section modality is On Ground. 2012 11:15a.m.-12:35p.m. MW DRSCHR 202 Kauffman S R Above section modality is On Ground. 2013 11:15a.m.-12:35p.m. MW ONLINE Will L J Above section modality is Scheduled. 2014 11:15a.m.-12:35p.m. MW ONLINE Wright N E Above section modality is Scheduled. 2017 11:15a.m.-12:35p.m. MW DRSCHR 213 Winkler K D Above section modality is On Ground. 2018 11:15a.m.-12:35p.m. TTh CMD 102 Karron R Above section 2018 meets at the Center for Media and Design, 1660 Stewart Street, Santa Monica CA 90404. Above section modality is On Ground. 2019 11:15a.m.-12:35p.m. TTh DRSCHR 215 Young W H Above section modality is On Ground. 2020 11:15a.m.-12:35p.m. TTh ONLINE Hertz U L Above section modality is Scheduled. 2021 11:15a.m.-12:35p.m. TTh ONLINE Garcia M S Above section modality is Scheduled. 2023 11:15a.m.-12:35p.m. TTh HSS 254 Will L J Above section modality is On Ground. 2024 11:15a.m.-12:35p.m. TTh HSS 253 Johnson D J Above section modality is On Ground. 2025 11:15a.m.-12:35p.m. TTh DRSCHR 218 Anderson E Above section modality is On Ground. 2028 11:15a.m.-12:35p.m. T BUS 201 Miller N A Arrange-1.5 Hours ONLINE Miller N A Above section 2028 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. 2031 11:15a.m.-12:35p.m. W HSS 206 Griffy W J Arrange-1.5 Hours ONLINE Griffy W J Above section 2031 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc. edu/OnlineEd. Above section is part of the Scholars Program and enrollment is temporarily limited to program participants. See the Special Programs section of the class schedule or smc.edu/scholars for more information. 2033 11:30a.m.-2:35p.m. F HSS 204 Ross M S Above section modality is On Ground. 2034 12:45p.m.-2:05p.m. MW DRSCHR 213 Winkler K D Above section modality is On Ground. 2036 12:45p.m.-2:05p.m. MW ONLINE Edelmann C Above section modality is Scheduled. 2039 12:45p.m.-2:05p.m. TTh HSS 206 Sterling A K Above section modality is On Ground. 2040 12:45p.m.-2:05p.m. TTh ONLINE Hamada M J Above section modality is Scheduled. 2042 12:45p.m.-2:05p.m. TTh HSS 254 Will L J Above section modality is On Ground. 2043 12:45p.m.-2:05p.m. T DRSCHR 203 Misaghi A M Arrange-1.5 Hours ONLINE Misaghi A M Above section 2043 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. 2044 12:45p.m.-2:05p.m. T DRSCHR 215 Onugha E L Arrange-1.5 Hours ONLINE Onugha E L Above section 2044 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc. edu/OnlineEd. Above section is part of the Scholars Program and enrollment is temporarily limited to program participants. See the Special Programs section of the class schedule or smc.edu/scholars for more information. 2047 12:45p.m.-2:05p.m. W HSS 206 Griffy W J Arrange-1.5 Hours ONLINE Griffy W J Above section 2047 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. FIRST-YEAR ENGLISH COURSE OPTIONS 4-25 Core Courses Academic Reading and Writing (3 units) ENGL C1000 Academic Reading and Writing (3 units) ENGL C1000 Intensive College Writing Skills (2 units) ENGLISH 28 English 28 is a non-transferable course. Formerly ENGL 1, Reading and Composition 1 Formerly ENGL 1, Reading and Composition 1 2048 12:45p.m.-2:05p.m. W DRSCHR 201 Garnica A M Arrange-1.5 Hours ONLINE Garnica A M Above section 2048 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. 2049 12:45p.m.-3:50p.m. T DRSCHR 218 Doucet W J Above section modality is On Ground. 2050 2:15p.m.-3:35p.m. MW ONLINE Edelmann C Above section modality is Scheduled. 2051 2:15p.m.-3:35p.m. MW DRSCHR 221 Robinson B Above section modality is On Ground. 2053 2:15p.m.-3:35p.m. M DRSCHR 218 Desai D H Arrange-1.5 Hours ONLINE Desai D H Above section 2053 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. 2054 2:15p.m.-3:35p.m. T DRSCHR 215 Del George D K Arrange-1.5 Hours ONLINE Del George D K Above section 2054 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. 2056 Arrange-6.5 Hours ONLINE Del George D K Above section 2056 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible. 2057 Arrange-3 Hours ONLINE Mattessich S N Above section modality is Flexible. 2058 Arrange-3 Hours ONLINE Rajski B Above section modality is Flexible. 2060 Arrange-3 Hours ONLINE Mattessich S N Above section modality is Flexible. 2064 Arrange-6.5 Hours ONLINE Caggiano S E Above section 2064 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible. 2065 Arrange-3 Hours ONLINE Blackwell N Above section modality is Flexible. 2066 Arrange-3 Hours ONLINE Blackwell N Above section modality is Flexible. 2067 Arrange-3 Hours ONLINE Mattessich S N Above section modality is Flexible. 2068 Arrange-3 Hours ONLINE Rajski B Above section modality is Flexible. 2069 Arrange-3 Hours ONLINE Mattessich S N Above section modality is Flexible. 2070 Arrange-3 Hours ONLINE Nelson Launa A Above section modality is Flexible. 2071 Arrange-3 Hours ONLINE Leinen S E Above section modality is Flexible. 2072 Arrange-3 Hours ONLINE Engelmann D S Above section modality is Flexible. 2073 Arrange-6.5 Hours ONLINE Meir N K Above section 2073 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible. 2074 Arrange-6.5 Hours ONLINE Del George D K Above section 2074 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible. 2075 Arrange-6.5 Hours ONLINE Cramer T R Above section 2075 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible. 2076 Arrange-6.5 Hours ONLINE Cramer T R Above section 2076 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible. 2077 Arrange-6.5 Hours ONLINE Cramer T R Above section 2077 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible. 2078 Arrange-6.5 Hours ONLINE Adams J J Above section 2078 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible. 2079 Arrange-3 Hours ONLINE Engelmann D S Above section modality is Flexible. 2082 Arrange-3 Hours ONLINE Engelmann D S Above section modality is Flexible. 2083 Arrange-3 Hours ONLINE Blackwell N Above section modality is Flexible. 2084 Arrange-6.5 Hours ONLINE Adams J J Above section 2084 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible. 2085 Arrange-3 Hours ONLINE Pritchard L A Above section modality is Flexible. 2086 Arrange-3 Hours ONLINE Pritchard L A Above section modality is Flexible. 2087 Arrange-3 Hours ONLINE Pritchard L A Above section modality is Flexible. 2088 Arrange-3 Hours ONLINE Pritchard L A Above section 2088 is part of the Scholars Program and enrollment is temporarily limited to program participants. See the Special Programs section of the class schedule or smc.edu/scholars for more information. Above section modality is Flexible. 2092 11:15a.m.-12:35p.m. W HSS 252 Peeples R A Arrange-3 Hours ONLINE Peeples R A Above section 2092 meets for 12 weeks, Sep 24 to Dec 10, and is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. 2097 12:45p.m.-2:50p.m. TTh HSS 253 Anderson E Above section 2097 meets for 12 weeks, Sep 23 to Dec 11. Above section modality is On Ground. 2098 Arrange-4.5 Hours ONLINE Kemper D E Above section 2098 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible. 2099 Arrange-4.5 Hours ONLINE Misaghi A M Above section 2099 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible. 2100 Arrange-4.5 Hours ONLINE Misaghi A M Above section 2100 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible. 2101 Arrange-4.5 Hours ONLINE Phillips L K Above section 2101 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible. 2102 Arrange-4.5 Hours ONLINE Phillips L K Above section 2102 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible. 2103 Arrange-4.5 Hours ONLINE Phillips L K Above section 2103 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible. 2104 Arrange-4.5 Hours ONLINE Bonar H S Above section 2104 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible. 2105 Arrange-4.5 Hours ONLINE Bonar H S Above section 2105 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible. 2107 Arrange-4.5 Hours ONLINE Bonar H S Above section 2107 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible. 2109 Arrange-6.5 Hours ONLINE Caggiano S E Above section 2109 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible. 2110 Arrange-6.5 Hours ONLINE Meir N K Above section 2110 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible. 2111 Arrange-6.5 Hours ONLINE Del George D K Above section 2111 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible. 2112 Arrange-6.5 Hours ONLINE Cramer T R Above section 2112 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible. 2113 Arrange-6.5 Hours ONLINE Del George D K Above section 2113 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible. 4090 6:45p.m.-9:50p.m. W ONLINE Edelmann C Above section modality is Scheduled.",
  "courses": [
    {
      "course_code": "ENGL 31",
      "course_title": "ADVANCED COMPOSITION",
      "units": "3 UNITS",
      "transfer_info": [
        "UC",
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": "ENGL C1000 (formerly ENGL 1).",
      "prerequisite_notes": null,
      "advisory": null,
      "advisory_notes": null,
      "formerly": null,
      "description": "This advanced writing course is intended especially for English majors and other students desiring to develop rhetorical skills beyond those practiced in English 1. It stresses critical analysis and argument, and focuses on style in effectively communicating with various audiences.",
      "same_as": null,
      "sections": [
        {
          "section_number": "1953",
          "schedule": [
            {
              "time": "Arrange-4.5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Caggiano S E"
            }
          ],
          "notes": [
            "Above section 1953 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible."
          ],
          "duration": "12 weeks, Sep 22 to Dec 12",
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    }
  ]
}