{
  "program_name": "English – Literature",
  "program_description": "ENGL C1001, CRITICAL THINKING AND WRITING 3 UNITS Transfer: UC, CSU C-ID: ENGL 105. Cal-GETC Area 1B (Critical Thinking and Composition) or Area 3B (Humanities) • Prerequisite: ENGL C1000 (formerly ENGL 1). Formerly ENGL 2. In this course, students receive instruction in critical thinking for purposes of constructing, evaluating, and composing arguments in a variety of rhetorical forms, using primarily non-fiction texts, refining writing skills and research strategies developed in ENGL C1000 Academic Reading and Writing (or C-ID ENGL 100) or similar first-year college writing course. 2114 8:00a.m.-9:20a.m. MW PA 13 Gildner B J Above section modality is On Ground. 2115 8:00a.m.-9:20a.m. MW HSS 254 Rajski B Above section modality is On Ground. 2116 8:00a.m.-9:20a.m. TTh DRSCHR 201 Peeples R A Above section modality is On Ground. 2117 8:00a.m.-9:20a.m. TTh ONLINE Meeks C Above section modality is Scheduled. 2118 8:00a.m.-9:20a.m. TTh DRSCHR 211 Johnson D J Above section modality is On Ground. 2119 8:00a.m.-9:20a.m. W DRSCHR 221 Ireland S P Arrange-1.5 Hours ONLINE Ireland S P Above section 2119 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/ OnlineEd. 2120 8:00a.m.-11:05a.m. F DRSCHR 222 Driscoll L V Above section modality is On Ground. 2121 9:30a.m.-10:50a.m. MW ONLINE Overall S J Above section modality is Scheduled. 2122 9:30a.m.-10:50a.m. MW PA 13 Gildner B J Above section modality is On Ground. 2123 9:30a.m.-10:50a.m. MW HSS 254 Rajski B Above section 2123 is part of the Scholars Program and enrollment is temporarily limited to program participants. See the Special Programs section of the class schedule or smc.edu/scholars for more information. Above section modality is On Ground. 2124 9:30a.m.-10:50a.m. TTh ONLINE Meeks C Above section modality is Scheduled. 2125 9:30a.m.-10:50a.m. TTh DRSCHR 201 Peeples R A Above section 2125 is part of the Scholars Program and enrollment is temporarily limited to program participants. See the Special Programs section of the class schedule or smc.edu/scholars for more information. Above section modality is On Ground. 2126 9:30a.m.-10:50a.m. TTh DRSCHR 211 Padilla M R Above section modality is On Ground. 2127 9:30a.m.-10:50a.m. TTh ONLINE Davison IV G S Above section modality is Scheduled. 2128 9:30a.m.-10:50a.m. TTh DRSCHR 218 Johnson D J Above section modality is On Ground. 2129 9:30a.m.-10:50a.m. W DRSCHR 221 Ireland S P Arrange-1.5 Hours ONLINE Ireland S P Above section 2129 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/ OnlineEd. 2130 9:30a.m.-10:50a.m. Th HSS 206 Espinosa A A Arrange-1.5 Hours ONLINE Espinosa A A Above section 2130 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/ OnlineEd. 2131 9:30a.m.-12:35p.m. F DRSCHR 201 Lemon W R Above section modality is On Ground. 2132 11:15a.m.-12:35p.m. MW DRSCHR 221 Robinson B Above section modality is On Ground. 2133 11:15a.m.-12:35p.m. MW PA 13 Gildner B J Above section modality is On Ground. 2134 11:15a.m.-12:35p.m. MW MALBU 119 Garcia M S Above section 2134 meets at the Malibu Campus, 23555 Civic Center Way, Malibu. Please be advised that the distance between the SMC Main Campus and the Malibu Campus is approximately 15 miles. Please plan your schedule to accommodate travel time, which will vary depending on time of day and mode of transportation. Above section modality is On Ground. 2135 11:15a.m.-12:35p.m. MW ONLINE Overall S J Above section modality is Scheduled. 2136 11:15a.m.-12:35p.m. TTh HSS 255 Dixon M J Above section modality is On Ground. 2137 11:15a.m.-12:35p.m. TTh ONLINE Hamada M J Above section modality is Scheduled. 2138 11:15a.m.-12:35p.m. TTh DRSCHR 208 Gomez J R Above section modality is On Ground. 2139 11:15a.m.-12:35p.m. TTh DRSCHR 217 Belkin J P Above section modality is On Ground. 2140 11:15a.m.-12:35p.m. TTh DRSCHR 221 Allen C D Above section modality is On Ground. 2141 11:30a.m.-2:35p.m. F DRSCHR 308 Doucet W J Above section 2141 is part of the Black Collegians program though enrollment is open to all students. See the Special Programs section of the class schedule or smc.edu/blackcollegians for more information. Above section modality is On Ground. 2142 12:45p.m.-2:05p.m. MW ONLINE Overall S J Above section modality is Scheduled. 2143 12:45p.m.-2:05p.m. MW DRSCHR 221 Robinson B Above section modality is On Ground. 2144 12:45p.m.-2:05p.m. MW DRSCHR 211 Padilla M R Above section 2144 is part of the Scholars Program and enrollment is temporarily limited to program participants. See the Special Programs section of the class schedule or smc.edu/scholars for more information. Above section modality is On Ground. 2145 12:45p.m.-2:05p.m. TTh DRSCHR 208 Herbert S Above section 2145 is part of the Scholars Program and enrollment is temporarily limited to program participants. See the Special Programs section of the class schedule or smc.edu/scholars for more information. Above section modality is On Ground. 2146 12:45p.m.-2:05p.m. TTh HSS 255 Dixon M J Above section modality is On Ground. 2147 12:45p.m.-2:05p.m. T HSS 205 Kemper D E Arrange-1.5 Hours ONLINE Kemper D E Above section 2147 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/ OnlineEd. 2148 2:15p.m.-3:35p.m. TTh HSS 255 Dixon M J Above section modality is On Ground. 2149 2:15p.m.-3:35p.m. T HSS 205 Kemper D E Arrange-1.5 Hours ONLINE Kemper D E Above section 2149 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/ OnlineEd. 2150 2:15p.m.-3:35p.m. Th DRSCHR 308 Peeples R A Arrange-1.5 Hours ONLINE Peeples R A Above section 2150 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/ OnlineEd. 2151 Arrange-3 Hours ONLINE Oba R K Above section modality is Flexible. 2152 Arrange-3 Hours ONLINE Davison IV G S Above section 2152 is part of the Scholars Program and enrollment is temporarily limited to program participants. See the Special Programs section of the class schedule or smc.edu/scholars for more information. Above section modality is Flexible. 2153 Arrange-3 Hours ONLINE Davison IV G S Above section modality is Flexible. 2154 Arrange-3 Hours ONLINE Menton K T Above section modality is Flexible. 2155 Arrange-3 Hours ONLINE Oba R K Above section modality is Flexible. 2156 Arrange-3 Hours ONLINE Menton K T Above section modality is Flexible. 2157 Arrange-6.5 Hours ONLINE Olvey K Above section 2157 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible. 2158 Arrange-6.5 Hours ONLINE Onugha E L Above section 2158 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible. 2159 Arrange-6.5 Hours ONLINE Gonzalez M Above section 2159 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible. 2160 Arrange-6.5 Hours ONLINE Menton K T Above section 2160 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible. 2161 Arrange-3 Hours ONLINE Engelmann D S Above section modality is Flexible. 2162 Arrange-3 Hours ONLINE Griffy W J Above section modality is Flexible. 2163 Arrange-3 Hours ONLINE Oba R K Above section modality is Flexible. 2164 Arrange-3 Hours ONLINE Menton K T Above section modality is Flexible. 2165 Arrange-6.5 Hours ONLINE Paik J Above section 2165 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible. 2166 Arrange-3 Hours ONLINE Davison IV G S Above section modality is Flexible. 2167 Arrange-3 Hours ONLINE Espinosa A A Above section modality is Flexible. 2168 11:15a.m.-12:35p.m. TTh DRSCHR 211 Takacs E Arrange-1.5 Hours ONLINE Takacs E Above section 2168 meets for 12 weeks, Sep 23 to Dec 11, and is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd. 2169 Arrange-4.5 Hours ONLINE Janakos L D Above section 2169 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible. 2170 Arrange-4.5 Hours ONLINE Janakos L D Above section 2170 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible. 2171 Arrange-4.5 Hours ONLINE Meir N K Above section 2171 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible. 2172 Arrange-4.5 Hours ONLINE Murphy E M Above section 2172 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible. 2173 Arrange-4.5 Hours ONLINE Murphy E M Above section 2173 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible. 2174 Arrange-6.5 Hours ONLINE Hotsinpiller Matthew Above section 2174 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible. 2175 Arrange-6.5 Hours ONLINE Arieff D E Above section 2175 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible. 2176 Arrange-6.5 Hours ONLINE Adams J J Above section 2176 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible. 2177 Arrange-6.5 Hours ONLINE Arieff D E Above section 2177 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible. 2178 Arrange-6.5 Hours ONLINE Adams J J Above section 2178 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible. 2179 Arrange-6.5 Hours ONLINE Gonzalez M Above section 2179 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible. 2180 Arrange-6.5 Hours ONLINE Paik J Above section 2180 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible. 2181 Arrange-6.5 Hours ONLINE Menton K T Above section 2181 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible. 4091 6:45p.m.-9:50p.m. M ONLINE Martinez-Gil C Above section modality is Scheduled.",
  "courses": [
    {
      "course_code": "ENGL 5",
      "course_title": "BRITISH LITERATURE 1",
      "units": "3 UNITS",
      "transfer_info": [
        "UC",
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": "Cal-GETC Area 3B (Humanities)",
      "special_notes": [],
      "prerequisites": "ENGL C1000 (formerly ENGL 1).",
      "advisory": "ENGL C1001 (formerly ENGL 2).",
      "formerly": null,
      "description": "This course surveys literature written in English in countries around the world, including but not limited to the British Isles and the American colonies, from the pre-Norman period in England to the late 18th century.",
      "same_as": null,
      "sections": [
        {
          "section_number": "1900",
          "schedule": [
            {
              "time": "12:45p.m.-2:05p.m.",
              "days": "MW",
              "location": "DRSCHR 222",
              "instructor": "Driscoll L V"
            }
          ],
          "notes": [
            "Above section modality is On Ground."
          ],
          "duration": null,
          "modality": "On Ground",
          "co_enrollment_with": null
        },
        {
          "section_number": "1901",
          "schedule": [
            {
              "time": "Arrange-4.5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Olvey K"
            }
          ],
          "notes": [
            "Above section 1901 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible."
          ],
          "duration": "12 weeks, Sep 22 to Dec 12",
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "ENGL 7",
      "course_title": "AMERICAN LITERATURE 1",
      "units": "3 UNITS",
      "transfer_info": [
        "UC",
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": "Cal-GETC Area 3B (Humanities)",
      "special_notes": [],
      "prerequisites": "ENGL C1000 (formerly ENGL 1).",
      "advisory": null,
      "formerly": null,
      "description": "This course surveys American literature from its beginnings to 1865.",
      "same_as": null,
      "sections": [
        {
          "section_number": "1902",
          "schedule": [
            {
              "time": "Arrange-3 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Onugha E L"
            }
          ],
          "notes": [
            "Above section modality is Flexible."
          ],
          "duration": null,
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "ENGL 8",
      "course_title": "AMERICAN LITERATURE 2",
      "units": "3 UNITS",
      "transfer_info": [
        "UC",
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": "Cal-GETC Area 3B (Humanities)",
      "special_notes": [],
      "prerequisites": "ENGL C1000 (formerly ENGL 1).",
      "advisory": null,
      "formerly": null,
      "description": "This course introduces students to a wide range of American authors and their relationship to major literary and intellectual movements from 1865 to the present.",
      "same_as": null,
      "sections": [
        {
          "section_number": "1903",
          "schedule": [
            {
              "time": "11:15a.m.-12:35p.m.",
              "days": "TTh",
              "location": "DRSCHR 202",
              "instructor": "Arms E D"
            }
          ],
          "notes": [
            "Above section modality is On Ground."
          ],
          "duration": null,
          "modality": "On Ground",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "ENGL 10",
      "course_title": "RACE AND ETHNICITY IN LITERATURE OF THE U.S.",
      "units": "3 UNITS",
      "transfer_info": [
        "UC",
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": "Cal-GETC Area 3B (Humanities)",
      "special_notes": [
        "Satisfies Global Citizenship"
      ],
      "prerequisites": "ENGL C1000 (formerly ENGL 1).",
      "advisory": "ENGL C1001 (formerly ENGL 2).",
      "formerly": null,
      "description": "OF THE U.S. 3 UNITS This course focuses on the literature written by and about the primary four United States’ racial groups: African Americans, Asian Americans, Latina/o/x Americans, and Native Americans. Students will analyze representative works from major genres and explore both the commonalities and differences among the works, with a focus on confusion and conflict around race and ethnicity specific to American history and culture. The course will also examine the influence of these writers and themes on American literature and the rethinking of the American literary canon.",
      "same_as": null,
      "sections": [
        {
          "section_number": "1904",
          "schedule": [
            {
              "time": "Arrange-3 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Griffy W J"
            }
          ],
          "notes": [
            "Above section modality is Flexible."
          ],
          "duration": null,
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "ENGL 15",
      "course_title": "SHAKESPEARE",
      "units": "3 UNITS",
      "transfer_info": [
        "UC",
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": "Cal-GETC Area 3B (Humanities)",
      "special_notes": [],
      "prerequisites": "ENGL C1000 (formerly ENGL 1).",
      "advisory": null,
      "formerly": null,
      "description": "In this course, students read and analyze seven or eight of Shakespeare’s most popular plays, as well as study his life, times, and theatre.",
      "same_as": null,
      "sections": [
        {
          "section_number": "1905",
          "schedule": [
            {
              "time": "Arrange-4.5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Murphy E M"
            }
          ],
          "notes": [
            "Above section 1905 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible."
          ],
          "duration": "12 weeks, Sep 22 to Dec 12",
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "ENGL 26",
      "course_title": "INTRODUCTION TO THE HUMANITIES",
      "units": "3 UNITS",
      "transfer_info": [
        "UC",
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": "Cal-GETC Area 3B (Humanities)",
      "special_notes": [],
      "prerequisites": "ENGL C1000 (formerly ENGL 1).",
      "advisory": null,
      "formerly": null,
      "description": "In this introduction to the humanities students will survey literature in conjunction with great works of art through the ages (painting, sculpture, music, architecture, dance) exploring how, at widely separated points in time, artists and writers have expressed and responded to cultural, political, and intellectual concerns of their day. In doing so, they will see literature in the context of other art forms.",
      "same_as": "HUM 26",
      "sections": [
        {
          "section_number": "1906",
          "schedule": [
            {
              "time": "Arrange-3 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Hassman T"
            }
          ],
          "notes": [
            "Above section modality is Flexible."
          ],
          "duration": null,
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "ENGL 40",
      "course_title": "ASIAN LITERATURE",
      "units": "3 UNITS",
      "transfer_info": [
        "UC",
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": "Cal-GETC Area 3B (Humanities)",
      "special_notes": [],
      "prerequisites": "ENGL C1000 (formerly ENGL 1).",
      "advisory": null,
      "formerly": null,
      "description": "Major works of Asian literature will provide a window to the rich cultures of a fascinating part of the world. Students will study literature of at least four Asian countries. The course is designed to introduce students to the important values of the society, the major beliefs and traditions of the culture, and prominent motifs of the arts of these countries.",
      "same_as": null,
      "sections": [
        {
          "section_number": "1954",
          "schedule": [
            {
              "time": "Arrange-4.5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Davison IV G S"
            }
          ],
          "notes": [
            "Above section 1954 meets for 12 weeks, Sep 22 to Dec 12. Above section modality is Flexible."
          ],
          "duration": "12 weeks, Sep 22 to Dec 12",
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "ENGL 50",
      "course_title": "MYTHOLOGY",
      "units": "3 UNITS",
      "transfer_info": [
        "UC",
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": "Cal-GETC Area 3B (Humanities)",
      "special_notes": [],
      "prerequisites": "ENGL C1000 (formerly ENGL 1).",
      "advisory": null,
      "formerly": null,
      "description": "This course studies the major characters and tales from Greek and Roman mythology. It takes a thematic approach to myths and legends from a variety of sources, examining humanity’s attempt to explain the unknown: the beginning of the world, creation of living creatures, explanation of natural phenomena, relationships between gods and mortals, deeds of super heroes, testing, death, and afterlife. The emphasis is primarily on Western culture — Greek and Roman myths which have influenced literature and allied arts from earliest time.",
      "same_as": null,
      "sections": [
        {
          "section_number": "1955",
          "schedule": [
            {
              "time": "Arrange-3 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Hioureas E C"
            }
          ],
          "notes": [
            "Above section modality is Flexible."
          ],
          "duration": null,
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "ENGL 51",
      "course_title": "LITERATURE OF THE BIBLE: OLD TESTAMENT",
      "units": "3 UNITS",
      "transfer_info": [
        "UC",
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": "Cal-GETC Area 3B (Humanities)",
      "special_notes": [],
      "prerequisites": "ENGL C1000 (formerly ENGL 1).",
      "advisory": null,
      "formerly": null,
      "description": "This course provides an analytical and critical study of the Old Testament of the Bible, focusing on its component genres and literary qualities. Attention is given to how Biblical literature has been and can be interpreted, studied, and used. Representative types of Biblical literature are examined.",
      "same_as": "REL ST 51",
      "sections": [
        {
          "section_number": "1956",
          "schedule": [
            {
              "time": "Arrange-3 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Meyer E E"
            }
          ],
          "notes": [
            "Above section modality is Flexible."
          ],
          "duration": null,
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "ENGL 61",
      "course_title": "INTRODUCTION TO THE FAIRY TALE",
      "units": "3 UNITS",
      "transfer_info": [
        "UC",
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": "Cal-GETC Area 3B (Humanities)",
      "special_notes": [],
      "prerequisites": "ENGL C1000 (formerly ENGL 1).",
      "advisory": null,
      "formerly": null,
      "description": "This course is a survey of the history, scholarship, and transformations of the fairy tale. The course includes a thematic approach to the first fairy tale collections, examination of notable criticism, and a review of modern reinventions in literature, film, and new media.",
      "same_as": null,
      "sections": [
        {
          "section_number": "1957",
          "schedule": [
            {
              "time": "Arrange-6.5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Cramer T R"
            }
          ],
          "notes": [
            "Above section 1957 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible."
          ],
          "duration": "8 weeks, Oct 27 to Dec 19",
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    }
  ]
}