{
  "program_name": "Office Technology",
  "program_description": "The Office Technology Department offers training in general, medical, and legal office skills. Office workers are responsible for a variety of administrative and clerical duties necessary to run and maintain organizations efficiently. They use a variety of software programs, produce correspondence, maintain databases, manage projects — as well as organize meetings, manage records, and perform receptionist duties. Office workers find employment in many settings, such as corporations, government agencies, schools, law offices, hospitals, and clinics. Some related job titles include office assistant, administrative medical assistant, medical billing and coding specialist, electronic health records specialist, and administrative secretary.",
  "courses": [
    {
      "course_code": "OFTECH 20",
      "course_title": "MEDICAL VOCABULARY",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "advisory": null,
      "formerly": null,
      "description": "This course is designed to develop medical vocabulary skills. Topics include word parts (roots, combining forms, prefixes, and suffixes), body structure, major body systems, and pharmacology. HIPAA (Health Insurance Portability and Accountability Act) guidelines and Internet research tools are also discussed.",
      "same_as": null,
      "sections": [
        {
          "section_number": "2833",
          "schedule": [
            {
              "time": "Arrange-6.5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Reed A M"
            }
          ],
          "notes": [
            "Above section 2833 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible."
          ],
          "duration": "8 weeks, Sep 03 to Oct 24",
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "OFTECH 21",
      "course_title": "MEDICAL TERMS AND TRANSCRIPTION 1",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "advisory": null,
      "formerly": null,
      "description": "TRANSCRIPTION 1 3 UNITS This is a beginning course in operating transcribing machines to produce medical documents. Students learn to transcribe, proofread, and edit a variety of medical documents, including chart notes, history and physical reports, consultations, office procedure notes, and X-ray reports. Emphasis is on vocabulary development related to major body systems, formatting, and language skills.",
      "same_as": null,
      "sections": [
        {
          "section_number": "2834",
          "schedule": [
            {
              "time": "Arrange-6.5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Reed A M"
            }
          ],
          "notes": [
            "Above section 2834 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible."
          ],
          "duration": "8 weeks, Oct 27 to Dec 19",
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "OFTECH 23",
      "course_title": "MEDICAL BILLING (MEDISOFT)",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "advisory": null,
      "formerly": null,
      "description": "The course introduces the basics of medical insurance billing and current payment methodologies in hospital and physician office settings. Students use MediSoft, a popular medical billing accounting software program, to enter patient and case information, schedule appointments, process transactions, and produce reports and patient statements.",
      "same_as": null,
      "sections": [
        {
          "section_number": "2835",
          "schedule": [
            {
              "time": "Arrange-11.3 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Reed A M"
            }
          ],
          "notes": [
            "Above section 2835 meets for 8 weeks, Sep 03 to Oct 24. Above section modality is Flexible."
          ],
          "duration": "8 weeks, Sep 03 to Oct 24",
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "OFTECH 24",
      "course_title": "MEDICAL CODING/BILLING 1",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "advisory": null,
      "formerly": null,
      "description": "Coding is defined as the translation of procedures, services, and supplies into numeric and/or alphanumeric components for statistical reporting and reimbursement purposes. This course introduces students to CPT, CPT Modifiers, and HCPCS coding procedures. This course will cover ICD-10.",
      "same_as": null,
      "sections": [
        {
          "section_number": "2836",
          "schedule": [
            {
              "time": "Arrange-6.5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Reed A M"
            }
          ],
          "notes": [
            "Above section 2836 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible."
          ],
          "duration": "8 weeks, Oct 27 to Dec 19",
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "OFTECH 28",
      "course_title": "ELECTRONIC HEALTH RECORDS",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "advisory": "OFTECH 20.",
      "formerly": null,
      "description": "This course discusses terminology, concepts, and procedures related to electronic health records and provides hands-on applications. Topics of study include advantages, core functions, data sources, workflow, coding standards, and privacy and security regulations of an Electronic Health Record (EHR) system. Students use EHR software to input patient data, create patient records, document office visits, order prescriptions and lab tests, and perform other tasks involved in patient care and management.",
      "same_as": null,
      "sections": [
        {
          "section_number": "2837",
          "schedule": [
            {
              "time": "Arrange-6.5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Reed A M"
            }
          ],
          "notes": [
            "Above section 2837 meets for 8 weeks, Oct 27 to Dec 19. Above section modality is Flexible."
          ],
          "duration": "8 weeks, Oct 27 to Dec 19",
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    }
  ]
}