{
  "program_name": "Sustainable Materials Management",
  "program_description": "",
  "courses": [
    {
      "course_code": "SMM 1",
      "course_title": "INTRODUCTION TO SUSTAINABLE MATERIALS MANAGEMENT",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [
        "Satisfies Global Citizenship"
      ],
      "prerequisites": null,
      "prerequisite_notes": null,
      "corequisites": null,
      "advisory": null,
      "advisory_notes": null,
      "formerly": null,
      "description": "This course introduces general terminology and principles regarding waste and sustainable materials management systems. The history of waste and materials management in California, including residential, commercial and institutional reuse, recycling, food recovery and composting programs, is addressed. An overview of state, national and global legislation and regulations related to sustainable materials management systems is provided. The course covers waste diversion practices such as reduce, reuse, recycle, and introduces principles in recovery, re-manufacturing, redesign and repurchasing.",
      "same_as": null,
      "sections": [
        {
          "section_number": "4184",
          "schedule": [
            {
              "time": "4:30p.m.-5:50p.m.",
              "days": "Th",
              "location": "ONLINE",
              "instructor": "Charles V H"
            },
            {
              "time": "Arrange-5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Charles V H"
            }
          ],
          "notes": [
            "Above section 4184 meets for 8 weeks, Sep 04 to Oct 23. Above section modality is Scheduled."
          ],
          "duration": "8 weeks, Sep 04 to Oct 23",
          "modality": "Scheduled",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "SMM 2",
      "course_title": "CULTURE AND ZERO WASTE",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "prerequisite_notes": null,
      "corequisites": null,
      "advisory": null,
      "advisory_notes": null,
      "formerly": null,
      "description": "This course will provide an overview of our “throw-away” culture and the motivations behind consumerism and related waste disposal practices. Key issues of the course include carbon footprint, plastics in our environment, consumer laws and cultural mindsets. The course will identify key government agencies and policies and how to collaborate and obtain funding for outreach. Environmental educational skills, programs, and methods will be reviewed. Case studies of successful outreach campaigns will be explored and the basics of establishing strong educational programs examined.",
      "same_as": null,
      "sections": [
        {
          "section_number": "4185",
          "schedule": [
            {
              "time": "6:30p.m.-7:50p.m.",
              "days": "Th",
              "location": "ONLINE",
              "instructor": "Charles V H"
            },
            {
              "time": "Arrange-5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Charles V H"
            }
          ],
          "notes": [
            "Above section 4185 meets for 8 weeks, Sep 04 to Oct 23. Above section modality is Scheduled."
          ],
          "duration": "8 weeks, Sep 04 to Oct 23",
          "modality": "Scheduled",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "SMM 3",
      "course_title": "SUSTAINABLE MATERIALS MANAGEMENT AND ZERO WASTE FOR COMMUNITIES",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "prerequisite_notes": null,
      "corequisites": null,
      "advisory": null,
      "advisory_notes": null,
      "formerly": null,
      "description": "This course will identify how sustainable materials management systems and Zero Waste policies and programs are developed within a community, what type of planning and facilities are needed, and how to finance the systems. Students will also review sample sustainability and zero waste plans and will discuss different approaches communities have taken to developing Zero Waste goals. Students will also learn about tools for local government, best practices for RFPs (Request for Proposals) and contracts, enforcement options, design of resource recovery parks, performance reporting and financial records, Extended Producer Responsibility and Local Producer Responsibility policies and programs, bans, rules and incentives, and local markets and uses for discarded resources.",
      "same_as": null,
      "sections": [
        {
          "section_number": "4186",
          "schedule": [
            {
              "time": "6:30p.m.-7:50p.m.",
              "days": "Th",
              "location": "ONLINE",
              "instructor": "Vincent A"
            },
            {
              "time": "Arrange-5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Vincent A"
            }
          ],
          "notes": [
            "Above section 4186 meets for 8 weeks, Oct 30 to Dec 18. Above section modality is Scheduled."
          ],
          "duration": "8 weeks, Oct 30 to Dec 18",
          "modality": "Scheduled",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "SMM 4",
      "course_title": "SUSTAINABLE MATERIALS MANAGEMENT AND ZERO WASTE IN BUSINESS",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "prerequisite_notes": null,
      "corequisites": null,
      "advisory": null,
      "advisory_notes": null,
      "formerly": null,
      "description": "This course will provide hands-on applications and tools for businesses to design, implement and oversee waste reduction and sustainable materials management programs. It will review a variety of best practices for successful waste diversion and recovery in businesses, detailing how businesses can implement those practices to achieve Zero Waste. Examination of case studies will be used to demonstrate how different companies have implemented successful waste diversion and sustainability programs, including triple bottom line business practices. This course will also provide students with an understanding of how to plan and implement commercial food and organics programs.",
      "same_as": null,
      "sections": [
        {
          "section_number": "4187",
          "schedule": [
            {
              "time": "6:30p.m.-7:50p.m.",
              "days": "T",
              "location": "ONLINE",
              "instructor": "Sasu S"
            },
            {
              "time": "Arrange-5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Sasu S"
            }
          ],
          "notes": [
            "Above section 4187 meets for 8 weeks, Oct 28 to Dec 16. Above section modality is Scheduled."
          ],
          "duration": "8 weeks, Oct 28 to Dec 16",
          "modality": "Scheduled",
          "co_enrollment_with": null
        }
      ]
    }
  ]
}