{
  "program_name": "Digital Media Post-Production",
  "program_description": "The Digital Media Post-Production program prepares students for careers in the entertainment industry through comprehensive, handson training. The program is designed to meet the industry’s need for creative professionals who excel in developing ideas and have the technical proficiency to execute them. Our instructors are experienced professionals who bring first-hand knowledge of industry practices to the classroom and work in close collaboration with industry advisors to keep up with trends and changing requirements. In addition, participating companies often provide guest speakers and student internships. We offer day, evening and weekend classes to provide educational opportunities to all students. In addition, select courses are offered online through Distance Education. Students who are interested in the Digital Media Post-Production program are strongly encouraged to schedule an appointment with one of the counselors at the Center for Media and Design campus to develop an Educational Plan. This is to ensure that you are taking the necessary courses to meet your educational goals. To learn more, please visit smc.edu/designtech. Students interested in independent studies or internships for the Digital Media Post-Production program may enroll in the Entertainment Technology (ET) 88 or 90 series of courses. Please speak with the Design Technology Department Chair or an Academic Counselor at the CMD for more information.",
  "courses": [
    {
      "course_code": "DMPOST 1",
      "course_title": "DIGITAL MEDIA WORKFLOW MANAGEMENT",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "prerequisite_notes": null,
      "corequisites": null,
      "advisory": null,
      "advisory_notes": null,
      "formerly": "ET 3",
      "description": "Effective project management plays a key role in the execution and completion of digital media projects. In this introductory course, students will learn step-by-step how a project develops and evolves through the project management process. The entire digital media workflow from scripting, budgeting, shooting, post-production, finishing, distribution and marketing will also be covered. Students will get an overview of how the courses at the CMD interrelate and fit within this total workflow. Guest speakers will provide current industry trends on how projects are produced, finished and distributed.",
      "same_as": null,
      "sections": [
        {
          "section_number": "4076",
          "schedule": [
            {
              "time": "6:30p.m.-9:35p.m.",
              "days": "W",
              "location": "ONLINE",
              "instructor": "Louie W B"
            }
          ],
          "notes": [
            "Above section modality is Scheduled."
          ],
          "duration": null,
          "modality": "Scheduled",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "DMPOST 2",
      "course_title": "DIGITAL AUDIO FUNDAMENTALS",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "prerequisite_notes": null,
      "corequisites": null,
      "advisory": null,
      "advisory_notes": null,
      "formerly": "ET 40",
      "description": "This course will introduce students to the fundamentals of digital audio design and provide them with the basic tools to use the technology appropriately, creatively, and effectively. A large element of “hands-on” practical experience will be balanced by an emphasis on understanding the fundamental theoretical principles of the technology and its applications within the entertainment industry. Topics covered will include the basic characteristics and differences between analog and digital audio; principles of good audio design; the essential hardware and software tools of music production in a digital environment; characteristics and differences between the main digital audio formats; basic principles of sound waveform editing; and recording techniques for multimedia and video integration. This course uses Avid Pro Tools.",
      "same_as": null,
      "sections": [
        {
          "section_number": "4077",
          "schedule": [
            {
              "time": "6:30p.m.-9:35p.m.",
              "days": "Th",
              "location": "CMD 280",
              "instructor": "Platt H H"
            },
            {
              "time": "Arrange-2 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Platt H H"
            }
          ],
          "notes": [
            "Above section 4077 is a hybrid class taught online via the Internet and at the Center for Media and Design, 1660 Stewart Street, Santa Monica CA 90404. For additional information, go to smc.edu/OnlineEd."
          ],
          "duration": null,
          "modality": "Hybrid",
          "co_enrollment_with": null
        },
        {
          "section_number": "4078",
          "schedule": [
            {
              "time": "7:00p.m.-9:35p.m.",
              "days": "MW",
              "location": "ONLINE",
              "instructor": "Iadarola M"
            },
            {
              "time": "Arrange-5.5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Iadarola M"
            }
          ],
          "notes": [
            "Above section 4078 meets for 8 weeks, Sep 03 to Oct 22. Above section is part of the Promo Pathway program and enrollment is limited to program participants. See the Special Programs section of the class schedule or smc.edu/promo for additional program information. Above section modality is Scheduled."
          ],
          "duration": "8 weeks, Sep 03 to Oct 22",
          "modality": "Scheduled",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "DMPOST 3",
      "course_title": "DIGITAL VIDEO FUNDAMENTALS",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "prerequisite_notes": null,
      "corequisites": null,
      "advisory": null,
      "advisory_notes": null,
      "formerly": "ET 31A",
      "description": "This introductory course familiarizes students with the fundamental aspects of digital video production. Covering acquisition formats, authoring formats and delivery formats. The class provides a strong foundation for working with visuals and sound in non-linear digital video post-production. Topics will include digital vs. analog, time code, frame rates, frame size, aspect ratios, broadcast and streaming codecs and distribution formats. This course uses Adobe Premiere Pro.",
      "same_as": null,
      "sections": [
        {
          "section_number": "1829",
          "schedule": [
            {
              "time": "9:30a.m.-12:35p.m.",
              "days": "T",
              "location": "CMD 280",
              "instructor": "Gorman K J"
            },
            {
              "time": "Arrange-2 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Gorman K J"
            }
          ],
          "notes": [
            "Above section 1829 is a hybrid class taught online via the Internet and at the Center for Media and Design, 1660 Stewart Street, Santa Monica CA 90404. For additional information, go to smc.edu/OnlineEd."
          ],
          "duration": null,
          "modality": "Hybrid",
          "co_enrollment_with": null
        },
        {
          "section_number": "1830",
          "schedule": [
            {
              "time": "9:30a.m.-12:35p.m.",
              "days": "F",
              "location": "ONLINE",
              "instructor": "Louie W B"
            },
            {
              "time": "Arrange-2 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Louie W B"
            }
          ],
          "notes": [
            "Above section modality is Scheduled."
          ],
          "duration": null,
          "modality": "Scheduled",
          "co_enrollment_with": null
        },
        {
          "section_number": "4079",
          "schedule": [
            {
              "time": "6:30p.m.-9:35p.m.",
              "days": "TTh",
              "location": "CMD 206",
              "instructor": "Louie W B"
            },
            {
              "time": "Arrange-5 Hours",
              "days": "N",
              "location": "TBA",
              "instructor": "Louie W B"
            }
          ],
          "notes": [
            "Above section 4079 meets for 8 weeks, Sep 02 to Oct 23, at the Center for Media and Design, 1660 Stewart Street, Santa Monica CA 90404. Above section is part of the Promo Pathway program and enrollment is limited to program participants. See the Special Programs section of the class schedule or smc.edu/promo for additional program information. Above section modality is On Ground."
          ],
          "duration": "8 weeks, Sep 02 to Oct 23",
          "modality": "On Ground",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "DMPOST 4",
      "course_title": "DIGITAL IMAGE FUNDAMENTALS",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "prerequisite_notes": null,
      "corequisites": null,
      "advisory": null,
      "advisory_notes": null,
      "formerly": "ET 38",
      "description": "This course covers the skills and concepts needed to create and manipulate images specifically for use in digital media projects. Students will learn the core concepts of working with image formats, brushes,selection tools, channels and layers as well as digital painting and color correction techniques. This course uses the Adobe Creative Cloud.",
      "same_as": null,
      "sections": [
        {
          "section_number": "1831",
          "schedule": [
            {
              "time": "Arrange-5.5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Abode Jr P J"
            }
          ],
          "notes": [
            "Above section modality is Flexible."
          ],
          "duration": null,
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "DMPOST 22",
      "course_title": "DIGITAL MUSIC PRODUCTION",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "prerequisite_notes": null,
      "corequisites": null,
      "advisory": "DMPOST 20",
      "advisory_notes": null,
      "formerly": "ET 41M",
      "description": "In this course, students will learn the skills necessary to digitally record and produce music at a professional level. Hands-on practical techniques will reinforce an understanding of recording, editing, programming and mixing for music production. Topics covered will include recording with microphones, programming electronic instruments, MIDI, proper use of audio effects and music mixing techniques. This course uses Avid Pro Tools.",
      "same_as": null,
      "sections": [
        {
          "section_number": "4080",
          "schedule": [
            {
              "time": "6:30p.m.-9:35p.m.",
              "days": "M",
              "location": "CMD 280",
              "instructor": "Norton N"
            },
            {
              "time": "Arrange-2 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Norton N"
            }
          ],
          "notes": [
            "Above section 4080 is a hybrid class taught online via the Internet and at the Center for Media and Design, 1660 Stewart Street, Santa Monica CA 90404. For additional information, go to smc.edu/OnlineEd. Above section 4080 will meet On Ground on Sept",
            "8, Oct 6, Nov 3, and Dec 1."
          ],
          "duration": null,
          "modality": "Hybrid",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "DMPOST 23",
      "course_title": "SOUND DESIGN",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "prerequisite_notes": null,
      "corequisites": null,
      "advisory": "DMPOST 20",
      "advisory_notes": null,
      "formerly": null,
      "description": "This course introduces the fundamentals of designing sound for digital media including film and television using a combination of practical and technological toolsets. Through a parity of theoretical and hands-on application, concepts will be disseminated and applied using industry-standard practices and equipment. Primary topics covered will include practical MIDI setup and implementation, basics of audio synthesis, exploration and use of digital Virtual Instruments, advanced signal processor controls and application as well as best practices for field and Foley recording.",
      "same_as": null,
      "sections": [
        {
          "section_number": "1832",
          "schedule": [
            {
              "time": "2:00p.m.-5:05p.m.",
              "days": "S",
              "location": "CMD 280",
              "instructor": "Platt H H"
            },
            {
              "time": "Arrange-2 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Platt H H"
            }
          ],
          "notes": [
            "Above section 1832 is a hybrid class taught online via the Internet and at the Center for Media and Design, 1660 Stewart Street, Santa Monica CA 90404. For additional information, go to smc.edu/OnlineEd."
          ],
          "duration": null,
          "modality": "Hybrid",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "DMPOST 30",
      "course_title": "DIGITAL VIDEO EDITING",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "prerequisite_notes": null,
      "corequisites": null,
      "advisory": "DMPOST 3",
      "advisory_notes": null,
      "formerly": "ET 31B",
      "description": "This course focuses on the advanced techniques, skills, and theories of editing as well as the technical requirements for assembling a digital video project. Through a series of handson projects, students will put traditional theories of picture and sound editing into practice using advanced techniques of layering, rotoscoping and motion graphics. This course will utilize a industry standard editing application with a shared storage server. This course uses Avid Media Composer.",
      "same_as": null,
      "sections": [
        {
          "section_number": "1833",
          "schedule": [
            {
              "time": "9:30a.m.-12:35p.m.",
              "days": "Th",
              "location": "CMD 280",
              "instructor": "Louie W B"
            },
            {
              "time": "Arrange-2 Hours",
              "days": "N",
              "location": "TBA",
              "instructor": "Louie W B"
            }
          ],
          "notes": [
            "Above section 1833 meets at the Center for Media and Design,",
            "1660 Stewart Street, Santa Monica CA 90404. Above section modality is On Ground."
          ],
          "duration": null,
          "modality": "On Ground",
          "co_enrollment_with": null
        },
        {
          "section_number": "1834",
          "schedule": [
            {
              "time": "2:00p.m.-5:05p.m.",
              "days": "W",
              "location": "ONLINE",
              "instructor": "Louie W B"
            },
            {
              "time": "Arrange-2 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Louie W B"
            }
          ],
          "notes": [
            "Above section modality is Scheduled."
          ],
          "duration": null,
          "modality": "Scheduled",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "DMPOST 31",
      "course_title": "DIGITAL COMPOSITING",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "prerequisite_notes": null,
      "corequisites": null,
      "advisory": "DMPOST 4",
      "advisory_notes": null,
      "formerly": "ET 32",
      "description": "Digital compositing is the process of digitally manipulating a combination of source images to produce a seamless whole. This course provides a complete overview of the compositing process as it is used in film/television, visual effects, and multimedia. Areas covered include image creation and manipulation techniques as well as design and color fundamentals. Through a series of exercises and projects, students will develop the aesthetic and technical skills necessary for integrating diverse visual elements into cohesive imagery. This course uses Adobe After Effects.",
      "same_as": null,
      "sections": [
        {
          "section_number": "1835",
          "schedule": [
            {
              "time": "Arrange-5.5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Uzan D"
            }
          ],
          "notes": [
            "Above section modality is Flexible."
          ],
          "duration": null,
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    }
  ]
}