{
  "program_name": "Game Design",
  "program_description": "Students interested in independent studies or internships for the Game Design program may enroll in the Entertainment Technology (ET) 88 or 90 series of courses. Please speak with the Design Technology Department Chair or an Academic Counselor at the CMD for more information.",
  "courses": [
    {
      "course_code": "GAME 1",
      "course_title": "GAME DESIGN FUNDAMENTALS",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "prerequisite_notes": null,
      "corequisites": null,
      "advisory": null,
      "advisory_notes": null,
      "formerly": "ET 42",
      "description": "This course is an introductory overview of the electronic game development process that underlines the historical context, content creation strategies, and future trends in the industry. The course will also explain how games are produced, tested, and released. This course will also cover the history of game platforms up to the most recent systems, and the expanded growth in Mobile, Casual, and Serious game development.",
      "same_as": null,
      "sections": [
        {
          "section_number": "2320",
          "schedule": [
            {
              "time": "Arrange-3 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Fayek I"
            }
          ],
          "notes": [
            "Above section modality is Flexible."
          ],
          "duration": null,
          "modality": "Flexible",
          "co_enrollment_with": null
        }
      ]
    },
    {
      "course_code": "GAME 2",
      "course_title": "GAME MECHANICS",
      "units": "3 UNITS",
      "transfer_info": [
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": null,
      "special_notes": [],
      "prerequisites": null,
      "prerequisite_notes": null,
      "corequisites": null,
      "advisory": null,
      "advisory_notes": null,
      "formerly": "ET 44",
      "description": "The focus of this course is on building a solid understanding of play mechanics: the formal elements of play, the dramatic elements that make a game meaningful to its players, and the system dynamics that shape the overall experience. Lectures will use historical and current games and genres to illustrate key concepts. Topics include strategy and tactics, resource management, emergent complexity, puzzles and puzzle development, and the business of games. Students will also learn the process of design through prototyping and playtesting.",
      "same_as": null,
      "sections": [
        {
          "section_number": "4108",
          "schedule": [
            {
              "time": "6:30p.m.-9:35p.m.",
              "days": "M",
              "location": "CMD 272",
              "instructor": "Fayek I"
            }
          ],
          "notes": [
            "Above section 4108 meets at the Center for Media and Design,",
            "1660 Stewart Street, Santa Monica CA 90404. Above section modality is On Ground."
          ],
          "duration": null,
          "modality": "On Ground",
          "co_enrollment_with": null
        }
      ]
    }
  ]
}