{
  "program_name": "Urban Studies",
  "program_description": "Urban Studies is an interdisciplinary investigation of our dynamic world of cities and their suburbs. From points of view ranging from the local to the global, students in this field examine cities as complex social groupings of people and institutions, as well as cultural landscapes of buildings, pathways, and public and private spaces. Urban Studies is concerned with what cities are and have been, as well as with ever-changing ideas about what cities could and should be. Urban Studies prepares students for careers in fields such as urban planning, architecture, public policy, and real-estate development, and it informs discussions of issues such as housing, transportation, urban renewal, segregation, sustainability, and suburban sprawl.",
  "courses": [
    {
      "course_code": "URBAN 8",
      "course_title": "INTRODUCTION TO URBAN STUDIES",
      "units": "3 UNITS",
      "transfer_info": [
        "UC",
        "CSU"
      ],
      "c_id": null,
      "cal_getc_area": "Cal-GETC Area 4 (Social & Behavioral Sciences)",
      "special_notes": [
        "URBAN 8 is the same course as GEOG 8. Students may earn credit for one, but not both."
      ],
      "prerequisites": null,
      "prerequisite_notes": null,
      "corequisites": null,
      "advisory": null,
      "advisory_notes": null,
      "formerly": null,
      "description": "This course introduces students to the multi-disciplinary study of urban society and space. Cities are examined both as complex social-economic groupings of people, and as material landscapes of buildings, pathways, and public and private spaces. Attention is paid to what cities are and have been (the evolving urban experience of the past and present) as well as to ever-changing ideas about what cities should be (urban planning and design for the future). While the overall perspective of the course is global, its primary focus is on the cities of North America and, in particular, the Los Angeles metropolitan area. This emphasis is evident both in the classroom and in field trips or other assignments that ask students to apply classroom ideas to our local urban setting.",
      "same_as": "GEOG 8",
      "sections": [
        {
          "section_number": "3190",
          "schedule": [
            {
              "time": "9:30a.m.-10:50a.m.",
              "days": "W",
              "location": "MSB 113",
              "instructor": "Morris P S"
            },
            {
              "time": "Arrange-1.5 Hours",
              "days": "N",
              "location": "ONLINE",
              "instructor": "Morris P S"
            }
          ],
          "notes": [
            "Above section 3190 is a hybrid class taught on campus and online via the Internet. For additional information, go to smc.edu/OnlineEd."
          ],
          "duration": null,
          "modality": "Hybrid",
          "co_enrollment_with": null
        }
      ]
    }
  ]
}